*** src/error.rs:66:9: replace AppError::retryable -> bool with false

*** mutation diff:
--- src/error.rs
+++ replace AppError::retryable -> bool with false
@@ -58,17 +58,17 @@
             Self::KeysAlreadyExist { .. } => "KEYS_ALREADY_EXIST",
             Self::InvalidCoordinate { .. } => "INVALID_COORDINATE",
             Self::Io { .. } => "IO_ERROR",
             Self::InvalidJson { .. } => "INVALID_JSON",
         }
     }
 
     pub fn retryable(&self) -> bool {
-        matches!(self, Self::RelayUnreachable { .. })
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn fix(&self) -> String {
         match self {
             Self::KeysNotFound { .. } => {
                 "Run `wokhei init --generate` to create a new keypair".to_string()
             }
             Self::RelayUnreachable { url } => {

---- error::tests::command_error_from_app_error_preserves_retryable stdout ----

thread 'error::tests::command_error_from_app_error_preserves_retryable' (5409966) panicked at src/error.rs:285:9:
assertion failed: cmd_err.retryable

---- error::tests::relay_unreachable_is_retryable stdout ----

thread 'error::tests::relay_unreachable_is_retryable' (5409972) panicked at src/error.rs:207:9:
assertion failed: e.retryable()

failures:
    error::tests::command_error_from_app_error_preserves_retryable
    error::tests::relay_unreachable_is_retryable

test result: FAILED. 97 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
