*** src/header.rs:23:5: replace build_header_tags -> Vec<Tag> with vec![]

*** mutation diff:
--- src/header.rs
+++ replace build_header_tags -> Vec<Tag> with vec![]
@@ -15,65 +15,17 @@
     pub recommended: Vec<String>,
     pub tags_list: Vec<String>,
     pub alt: Option<String>,
     pub addressable: bool,
     pub d_tag: Option<String>,
 }
 
 fn build_header_tags(params: &HeaderParams, kind: Kind) -> Vec<Tag> {
-    let HeaderParams {
-        name,
-        aliases,
-        title,
-        description,
-        required,
-        recommended,
-        tags_list,
-        alt,
-        d_tag,
-        ..
-    } = params;
-
-    let mut event_tags: Vec<Tag> = Vec::new();
-
-    let mut name_values = vec![name.clone()];
-    name_values.extend(aliases.clone());
-    event_tags.push(Tag::custom(TagKind::custom("names"), name_values));
-    event_tags.push(Tag::custom(TagKind::custom("title"), [title.clone()]));
-
-    if let Some(desc) = description {
-        event_tags.push(Tag::custom(TagKind::custom("description"), [desc.clone()]));
-    }
-    if !required.is_empty() {
-        event_tags.push(Tag::custom(TagKind::custom("required"), required.clone()));
-    }
-    if !recommended.is_empty() {
-        event_tags.push(Tag::custom(
-            TagKind::custom("recommended"),
-            recommended.clone(),
-        ));
-    }
-    for tag in tags_list {
-        event_tags.push(Tag::hashtag(tag));
-    }
-
-    let alt_text = alt
-        .clone()
-        .unwrap_or_else(|| format!("DCoSL list header: {name} — {title}"));
-    event_tags.push(Tag::custom(TagKind::custom("alt"), [alt_text]));
-    event_tags.push(Tag::custom(TagKind::custom("client"), ["wokhei"]));
-
-    if let Some(d) = d_tag {
-        event_tags.push(Tag::identifier(d));
-    }
-
-    // Suppress unused variable warning — kind is used by caller context
-    let _ = kind;
-    event_tags
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn minimal_params() -> HeaderParams {
         HeaderParams {

---- header::tests::aliases_appended_to_names stdout ----

thread 'header::tests::aliases_appended_to_names' (5425015) panicked at src/header.rs:91:46:
called `Option::unwrap()` on a `None` value

---- header::tests::custom_alt_text_overrides_default stdout ----

thread 'header::tests::custom_alt_text_overrides_default' (5425016) panicked at src/header.rs:144:42:
called `Option::unwrap()` on a `None` value

---- header::tests::description_present_when_set stdout ----

thread 'header::tests::description_present_when_set' (5425019) panicked at src/header.rs:100:51:
description tag missing

failures:
    header::tests::aliases_appended_to_names
    header::tests::custom_alt_text_overrides_default
    header::tests::d_tag_adds_identifier
    header::tests::description_present_when_set
    header::tests::hashtags_generated_from_tags_list
    header::tests::minimal_params_has_alt_tag_with_default
    header::tests::minimal_params_has_client_tag
    header::tests::minimal_params_has_names_tag
    header::tests::minimal_params_has_title_tag
    header::tests::recommended_fields_present
    header::tests::required_fields_present
    tests::resolve_relay_default_fallback

test result: FAILED. 87 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
