*** src/header.rs:46:8: delete ! in build_header_tags

*** mutation diff:
--- src/header.rs
+++ delete ! in build_header_tags
@@ -38,17 +38,17 @@
     let mut name_values = vec![name.clone()];
     name_values.extend(aliases.clone());
     event_tags.push(Tag::custom(TagKind::custom("names"), name_values));
     event_tags.push(Tag::custom(TagKind::custom("title"), [title.clone()]));
 
     if let Some(desc) = description {
         event_tags.push(Tag::custom(TagKind::custom("description"), [desc.clone()]));
     }
-    if !required.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */required.is_empty() {
         event_tags.push(Tag::custom(TagKind::custom("required"), required.clone()));
     }
     if !recommended.is_empty() {
         event_tags.push(Tag::custom(
             TagKind::custom("recommended"),
             recommended.clone(),
         ));
     }

---- header::tests::required_fields_present stdout ----

thread 'header::tests::required_fields_present' (5422444) panicked at src/header.rs:163:47:
required tag missing

failures:
    header::tests::required_fields_present

test result: FAILED. 98 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
