*** src/keys.rs:102:5: replace post_init_actions -> Vec<NextAction> with vec![]

*** mutation diff:
--- src/keys.rs
+++ replace post_init_actions -> Vec<NextAction> with vec![]
@@ -94,27 +94,17 @@
     json!({
         "pubkey": pubkey_hex,
         "npub": npub,
         "keys_path": keys_path().display().to_string()
     })
 }
 
 fn post_init_actions(pubkey_hex: &str) -> Vec<NextAction> {
-    vec![
-        NextAction::new("wokhei whoami", "Verify your identity"),
-        NextAction::new(
-            "wokhei create-header --name=<name> --title=<title>",
-            "Create your first list header",
-        ),
-        NextAction::new(
-            format!("wokhei list-headers --author={pubkey_hex}"),
-            "List your headers",
-        ),
-    ]
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_nsec<R: io::Read>(source: &str, stdin: R) -> Result<String, CommandError> {
     let raw = if source == "-" {
         let mut buf = String::new();
         let mut reader = stdin;
         reader.read_to_string(&mut buf).map_err(|e| {
             CommandError::from(AppError::Io {

---- keys::tests::post_init_actions_contains_pubkey stdout ----

thread 'keys::tests::post_init_actions_contains_pubkey' (5410437) panicked at src/keys.rs:264:9:
assertion failed: actions.iter().any(|a| a.command.contains("abc123"))

---- keys::tests::post_init_actions_contains_whoami stdout ----

thread 'keys::tests::post_init_actions_contains_whoami' (5410438) panicked at src/keys.rs:258:9:
assertion failed: actions.iter().any(|a| a.command.contains("whoami"))

---- keys::tests::post_init_actions_non_empty stdout ----

thread 'keys::tests::post_init_actions_non_empty' (5410439) panicked at src/keys.rs:252:9:
assertion failed: !actions.is_empty()

failures:
    keys::tests::post_init_actions_contains_pubkey
    keys::tests::post_init_actions_contains_whoami
    keys::tests::post_init_actions_non_empty

test result: FAILED. 96 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
