*** src/keys.rs:116:5: replace read_nsec -> Result<String, CommandError> with Ok(String::new())

*** mutation diff:
--- src/keys.rs
+++ replace read_nsec -> Result<String, CommandError> with Ok(String::new())
@@ -108,33 +108,17 @@
         NextAction::new(
             format!("wokhei list-headers --author={pubkey_hex}"),
             "List your headers",
         ),
     ]
 }
 
 fn read_nsec<R: io::Read>(source: &str, stdin: R) -> Result<String, CommandError> {
-    let raw = if source == "-" {
-        let mut buf = String::new();
-        let mut reader = stdin;
-        reader.read_to_string(&mut buf).map_err(|e| {
-            CommandError::from(AppError::Io {
-                reason: e.to_string(),
-            })
-        })?;
-        buf
-    } else {
-        fs::read_to_string(source).map_err(|e| {
-            CommandError::from(AppError::Io {
-                reason: format!("Failed to read {source}: {e}"),
-            })
-        })?
-    };
-    Ok(raw.trim().to_string())
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_nsec_from_source(source: &str) -> Result<String, CommandError> {
     read_nsec(source, io::stdin())
 }
 
 pub fn init(generate: bool, import: Option<&str>) -> Result<CommandOutput, CommandError> {
     if !generate && import.is_none() {

---- keys::tests::read_nsec_from_stdin_cursor stdout ----

thread 'keys::tests::read_nsec_from_stdin_cursor' (5412166) panicked at src/keys.rs:269:9:
assertion `left == right` failed
  left: ""
 right: "nsec1test"

---- keys::tests::read_nsec_from_file stdout ----

thread 'keys::tests::read_nsec_from_file' (5412165) panicked at src/keys.rs:286:9:
assertion `left == right` failed
  left: ""
 right: "nsec1fromfile"

---- keys::tests::read_nsec_nonexistent_file_errors stdout ----

thread 'keys::tests::read_nsec_nonexistent_file_errors' (5412167) panicked at src/keys.rs:292:67:
called `Result::unwrap_err()` on an `Ok` value: ""

failures:
    keys::tests::read_nsec_from_file
    keys::tests::read_nsec_from_stdin_cursor
    keys::tests::read_nsec_nonexistent_file_errors
    keys::tests::read_nsec_trims_whitespace

test result: FAILED. 95 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
