*** src/keys.rs:16:5: replace keys_dir_from -> PathBuf with Default::default()

*** mutation diff:
--- src/keys.rs
+++ replace keys_dir_from -> PathBuf with Default::default()
@@ -8,17 +8,17 @@
 
 use crate::error::AppError;
 
 // ---------------------------------------------------------------------------
 // Parameterized path helpers (testable without touching $HOME)
 // ---------------------------------------------------------------------------
 
 fn keys_dir_from(base: &Path) -> PathBuf {
-    base.join(".wokhei")
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn keys_path_from(base: &Path) -> PathBuf {
     keys_dir_from(base).join("keys")
 }
 
 fn home_base() -> PathBuf {
     dirs::home_dir().unwrap_or_else(|| PathBuf::from("."))

---- keys::tests::keys_dir_from_appends_wokhei stdout ----

thread 'keys::tests::keys_dir_from_appends_wokhei' (5425898) panicked at src/keys.rs:218:9:
assertion `left == right` failed
  left: ""
 right: "/tmp/test-home/.wokhei"

---- keys::tests::keys_path_from_appends_keys stdout ----

thread 'keys::tests::keys_path_from_appends_keys' (5425899) panicked at src/keys.rs:224:9:
assertion `left == right` failed
  left: "keys"
 right: "/tmp/test-home/.wokhei/keys"

---- keys::tests::keys_result_has_keys_path stdout ----

thread 'keys::tests::keys_result_has_keys_path' (5425901) panicked at src/keys.rs:252:9:
assertion failed: j["keys_path"].as_str().unwrap().contains(".wokhei/keys")

failures:
    keys::tests::keys_dir_from_appends_wokhei
    keys::tests::keys_path_from_appends_keys
    keys::tests::keys_result_has_keys_path
    keys::tests::save_and_load_roundtrip
    keys::tests::save_creates_directory_and_file
    tests::resolve_relay_default_fallback

test result: FAILED. 93 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
