*** src/keys.rs:20:5: replace keys_path_from -> PathBuf with Default::default()

*** mutation diff:
--- src/keys.rs
+++ replace keys_path_from -> PathBuf with Default::default()
@@ -12,17 +12,17 @@
 // Parameterized path helpers (testable without touching $HOME)
 // ---------------------------------------------------------------------------
 
 fn keys_dir_from(base: &Path) -> PathBuf {
     base.join(".wokhei")
 }
 
 fn keys_path_from(base: &Path) -> PathBuf {
-    keys_dir_from(base).join("keys")
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn home_base() -> PathBuf {
     dirs::home_dir().unwrap_or_else(|| PathBuf::from("."))
 }
 
 fn keys_path() -> PathBuf {
     keys_path_from(&home_base())

---- keys::tests::keys_path_from_appends_keys stdout ----

thread 'keys::tests::keys_path_from_appends_keys' (5413432) panicked at src/keys.rs:224:9:
assertion `left == right` failed
  left: ""
 right: "/tmp/test-home/.wokhei/keys"

---- keys::tests::keys_result_has_keys_path stdout ----

thread 'keys::tests::keys_result_has_keys_path' (5413434) panicked at src/keys.rs:252:9:
assertion failed: j["keys_path"].as_str().unwrap().contains(".wokhei/keys")

---- keys::tests::save_creates_directory_and_file stdout ----

thread 'keys::tests::save_creates_directory_and_file' (5413445) panicked at src/keys.rs:336:41:
called `Result::unwrap()` on an `Err` value: KeysSaveFailed { reason: "No such file or directory (os error 2)" }

failures:
    keys::tests::keys_path_from_appends_keys
    keys::tests::keys_result_has_keys_path
    keys::tests::save_and_load_roundtrip
    keys::tests::save_creates_directory_and_file
    keys::tests::save_sets_permissions_0600

test result: FAILED. 94 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
