*** src/main.rs:21:5: replace parse_bool_flag -> Result<bool, CommandError> with Ok(true)

*** mutation diff:
--- src/main.rs
+++ replace parse_bool_flag -> Result<bool, CommandError> with Ok(true)
@@ -13,25 +13,17 @@
 use serde_json::json;
 
 // ---------------------------------------------------------------------------
 // Validation helpers (agcli is schema-less — we enforce constraints ourselves)
 // ---------------------------------------------------------------------------
 
 /// Parse a boolean flag strictly. Absent = false, "true" = true, anything else = error.
 fn parse_bool_flag(req: &CommandRequest<'_>, name: &str) -> Result<bool, CommandError> {
-    match req.flag(name) {
-        None => Ok(false),
-        Some("true") => Ok(true),
-        Some(other) => Err(CommandError::new(
-            format!("--{name} is a boolean flag, got unexpected value: {other}"),
-            "INVALID_ARGS",
-            format!("Use --{name} without a value, or remove it"),
-        )),
-    }
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse comma-separated flag value into Vec<String>. Absent = empty vec.
 fn parse_csv(flag_value: Option<&str>) -> Vec<String> {
     match flag_value {
         Some(s) if !s.is_empty() => s.split(',').map(|v| v.trim().to_string()).collect(),
         _ => Vec::new(),
     }

---- tests::bool_flag_invalid_value_errors stdout ----

thread 'tests::bool_flag_invalid_value_errors' (5420373) panicked at src/main.rs:327:9:
assertion failed: !exec.envelope().ok()

---- tests::bool_flag_absent_is_false stdout ----

thread 'tests::bool_flag_absent_is_false' (5420370) panicked at src/main.rs:305:9:
assertion `left == right` failed
  left: Bool(true)
 right: false

failures:
    tests::bool_flag_absent_is_false
    tests::bool_flag_invalid_value_errors

test result: FAILED. 97 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
