*** src/main.rs:35:20: replace match guard !s.is_empty() with false in parse_csv

*** mutation diff:
--- src/main.rs
+++ replace match guard !s.is_empty() with false in parse_csv
@@ -27,17 +27,17 @@
             format!("Use --{name} without a value, or remove it"),
         )),
     }
 }
 
 /// Parse comma-separated flag value into Vec<String>. Absent = empty vec.
 fn parse_csv(flag_value: Option<&str>) -> Vec<String> {
     match flag_value {
-        Some(s) if !s.is_empty() => s.split(',').map(|v| v.trim().to_string()).collect(),
+        Some(s) if false /* ~ changed by cargo-mutants ~ */ => s.split(',').map(|v| v.trim().to_string()).collect(),
         _ => Vec::new(),
     }
 }
 
 /// Parse a usize flag with a default. Invalid values return error.
 fn parse_usize_flag(
     req: &CommandRequest<'_>,
     name: &str,

---- tests::parse_csv_multiple_values stdout ----

thread 'tests::parse_csv_multiple_values' (5416014) panicked at src/main.rs:287:9:
assertion `left == right` failed
  left: []
 right: ["a", "b", "c"]

---- tests::parse_csv_single_value stdout ----

thread 'tests::parse_csv_single_value' (5416016) panicked at src/main.rs:282:9:
assertion `left == right` failed
  left: []
 right: ["a"]

---- tests::parse_csv_trims_whitespace stdout ----

thread 'tests::parse_csv_trims_whitespace' (5416017) panicked at src/main.rs:292:9:
assertion `left == right` failed
  left: []
 right: ["a", "b"]

failures:
    tests::parse_csv_multiple_values
    tests::parse_csv_single_value
    tests::parse_csv_trims_whitespace

test result: FAILED. 96 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
