*** src/main.rs:60:5: replace resolve_relay -> String with String::new()

*** mutation diff:
--- src/main.rs
+++ replace resolve_relay -> String with String::new()
@@ -52,20 +52,17 @@
                 format!("Provide a valid number for --{name}"),
             )
         }),
     }
 }
 
 /// Resolve relay URL from --relay flag, `WOKHEI_RELAY` env var, or default.
 fn resolve_relay(req: &CommandRequest<'_>) -> String {
-    req.flag("relay")
-        .map(String::from)
-        .or_else(|| std::env::var("WOKHEI_RELAY").ok())
-        .unwrap_or_else(|| "ws://localhost:7777".to_string())
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Command builders
 // ---------------------------------------------------------------------------
 
 fn init_command() -> Command {
     Command::new(

---- tests::resolve_relay_env_var stdout ----

thread 'tests::resolve_relay_env_var' (5427668) panicked at src/main.rs:421:9:
assertion `left == right` failed
  left: ""
 right: "ws://envrelay:5555"

---- tests::resolve_relay_flag_beats_env stdout ----

thread 'tests::resolve_relay_flag_beats_env' (5427669) panicked at src/main.rs:429:9:
assertion `left == right` failed
  left: ""
 right: "ws://flagrelay:9999"

---- tests::resolve_relay_default_fallback stdout ----

thread 'tests::resolve_relay_default_fallback' (5427667) panicked at src/main.rs:406:9:
assertion `left == right` failed
  left: ""
 right: "ws://localhost:7777"

failures:
    tests::resolve_relay_default_fallback
    tests::resolve_relay_env_var
    tests::resolve_relay_flag_beats_env
    tests::resolve_relay_flag_override

test result: FAILED. 95 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
