*** src/query.rs:10:5: replace event_to_json -> serde_json::Value with Default::default()

*** mutation diff:
--- src/query.rs
+++ replace event_to_json -> serde_json::Value with Default::default()
@@ -2,63 +2,17 @@
 use serde_json::json;
 use std::time::Duration;
 
 use agcli::{CommandError, CommandOutput, NextAction};
 
 use crate::error::AppError;
 
 fn event_to_json(event: &Event) -> serde_json::Value {
-    let tags: Vec<Vec<String>> = event
-        .tags
-        .iter()
-        .map(|t| t.as_slice().iter().map(ToString::to_string).collect())
-        .collect();
-
-    let mut obj = json!({
-        "event_id": event.id.to_hex(),
-        "kind": event.kind.as_u16(),
-        "pubkey": event.pubkey.to_hex(),
-        "created_at": event.created_at.as_secs(),
-        "tags": tags,
-        "content": event.content,
-        "sig": event.sig.to_string(),
-    });
-
-    // Extract common DCoSL fields from tags for convenience
-    for tag in event.tags.iter() {
-        let parts = tag.as_slice();
-        if parts.len() >= 2 {
-            let key = parts[0].as_str();
-            match key {
-                "names" => {
-                    let names: Vec<&str> = parts[1..].iter().map(String::as_str).collect();
-                    obj["name"] = json!(names.first().unwrap_or(&""));
-                    if names.len() > 1 {
-                        obj["aliases"] = json!(&names[1..]);
-                    }
-                }
-                "title" => {
-                    obj["title"] = json!(parts[1].as_str());
-                }
-                "description" => {
-                    obj["description"] = json!(parts[1].as_str());
-                }
-                "d" => {
-                    let pubkey_hex = event.pubkey.to_hex();
-                    let d_val = parts[1].as_str();
-                    obj["coordinate"] =
-                        json!(format!("{}:{}:{}", event.kind.as_u16(), pubkey_hex, d_val));
-                }
-                _ => {}
-            }
-        }
-    }
-
-    obj
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn make_event(kind: Kind, content: &str, tags: Vec<Tag>) -> Event {
         let keys = Keys::generate();

---- query::tests::event_to_json_d_tag_creates_coordinate stdout ----

thread 'query::tests::event_to_json_d_tag_creates_coordinate' (5409592) panicked at src/query.rs:89:46:
called `Option::unwrap()` on a `None` value

---- query::tests::event_to_json_basic_fields stdout ----

thread 'query::tests::event_to_json_basic_fields' (5409590) panicked at src/query.rs:29:9:
assertion failed: j["event_id"].is_string()

---- query::tests::event_to_json_content_preserved stdout ----

thread 'query::tests::event_to_json_content_preserved' (5409591) panicked at src/query.rs:109:9:
assertion `left == right` failed
  left: Null
 right: "{\"key\":\"val\"}"

failures:
    query::tests::event_to_json_basic_fields
    query::tests::event_to_json_content_preserved
    query::tests::event_to_json_d_tag_creates_coordinate
    query::tests::event_to_json_description_extracted
    query::tests::event_to_json_names_tag_extracts_name_and_aliases
    query::tests::event_to_json_single_name_no_aliases
    query::tests::event_to_json_tags_array_structure
    query::tests::event_to_json_title_extracted

test result: FAILED. 91 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
