*** src/query.rs:32:17: delete match arm "names" in event_to_json

*** mutation diff:
--- src/query.rs
+++ delete match arm "names" in event_to_json
@@ -24,23 +24,17 @@
     });
 
     // Extract common DCoSL fields from tags for convenience
     for tag in event.tags.iter() {
         let parts = tag.as_slice();
         if parts.len() >= 2 {
             let key = parts[0].as_str();
             match key {
-                "names" => {
-                    let names: Vec<&str> = parts[1..].iter().map(String::as_str).collect();
-                    obj["name"] = json!(names.first().unwrap_or(&""));
-                    if names.len() > 1 {
-                        obj["aliases"] = json!(&names[1..]);
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 "title" => {
                     obj["title"] = json!(parts[1].as_str());
                 }
                 "description" => {
                     obj["description"] = json!(parts[1].as_str());
                 }
                 "d" => {
                     let pubkey_hex = event.pubkey.to_hex();

---- query::tests::event_to_json_single_name_no_aliases stdout ----

thread 'query::tests::event_to_json_single_name_no_aliases' (5408290) panicked at src/query.rs:96:9:
assertion `left == right` failed
  left: Null
 right: "mylist"

---- query::tests::event_to_json_names_tag_extracts_name_and_aliases stdout ----

thread 'query::tests::event_to_json_names_tag_extracts_name_and_aliases' (5408289) panicked at src/query.rs:85:9:
assertion `left == right` failed
  left: Null
 right: "mylist"

failures:
    query::tests::event_to_json_names_tag_extracts_name_and_aliases
    query::tests::event_to_json_single_name_no_aliases

test result: FAILED. 97 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
