*** src/query.rs:35:36: replace > with == in event_to_json

*** mutation diff:
--- src/query.rs
+++ replace > with == in event_to_json
@@ -27,17 +27,17 @@
     for tag in event.tags.iter() {
         let parts = tag.as_slice();
         if parts.len() >= 2 {
             let key = parts[0].as_str();
             match key {
                 "names" => {
                     let names: Vec<&str> = parts[1..].iter().map(String::as_str).collect();
                     obj["name"] = json!(names.first().unwrap_or(&""));
-                    if names.len() > 1 {
+                    if names.len() == /* ~ changed by cargo-mutants ~ */ 1 {
                         obj["aliases"] = json!(&names[1..]);
                     }
                 }
                 "title" => {
                     obj["title"] = json!(parts[1].as_str());
                 }
                 "description" => {
                     obj["description"] = json!(parts[1].as_str());

---- query::tests::event_to_json_single_name_no_aliases stdout ----

thread 'query::tests::event_to_json_single_name_no_aliases' (5424645) panicked at src/query.rs:103:9:
assertion failed: j.get("aliases").is_none()

---- query::tests::event_to_json_names_tag_extracts_name_and_aliases stdout ----

thread 'query::tests::event_to_json_names_tag_extracts_name_and_aliases' (5424644) panicked at src/query.rs:92:9:
assertion `left == right` failed
  left: Null
 right: Array [String("alias1"), String("alias2")]

failures:
    query::tests::event_to_json_names_tag_extracts_name_and_aliases
    query::tests::event_to_json_single_name_no_aliases

test result: FAILED. 97 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
