*** src/query.rs:42:17: delete match arm "description" in event_to_json

*** mutation diff:
--- src/query.rs
+++ delete match arm "description" in event_to_json
@@ -34,19 +34,17 @@
                     obj["name"] = json!(names.first().unwrap_or(&""));
                     if names.len() > 1 {
                         obj["aliases"] = json!(&names[1..]);
                     }
                 }
                 "title" => {
                     obj["title"] = json!(parts[1].as_str());
                 }
-                "description" => {
-                    obj["description"] = json!(parts[1].as_str());
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 "d" => {
                     let pubkey_hex = event.pubkey.to_hex();
                     let d_val = parts[1].as_str();
                     obj["coordinate"] =
                         json!(format!("{}:{}:{}", event.kind.as_u16(), pubkey_hex, d_val));
                 }
                 _ => {}
             }

---- query::tests::event_to_json_description_extracted stdout ----

thread 'query::tests::event_to_json_description_extracted' (5412600) panicked at src/query.rs:121:9:
assertion `left == right` failed
  left: Null
 right: "A description"

failures:
    query::tests::event_to_json_description_extracted

test result: FAILED. 98 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
