*** src/error.rs:48:9: replace AppError::code -> &'static str with ""

*** mutation diff:
--- src/error.rs
+++ replace AppError::code -> &'static str with ""
@@ -40,31 +40,17 @@
     Io { reason: String },
 
     #[error("Invalid JSON: {reason}")]
     InvalidJson { reason: String },
 }
 
 impl AppError {
     pub fn code(&self) -> &'static str {
-        match self {
-            Self::KeysNotFound { .. } => "KEYS_NOT_FOUND",
-            Self::RelayUnreachable { .. } => "RELAY_UNREACHABLE",
-            Self::RelayRejected { .. } => "RELAY_REJECTED",
-            Self::HeaderNotFound { .. } => "HEADER_NOT_FOUND",
-            Self::HeaderMissingDTag => "HEADER_MISSING_D_TAG",
-            Self::InvalidEventId { .. } => "INVALID_EVENT_ID",
-            Self::NoResults => "NO_RESULTS",
-            Self::InvalidNsec => "INVALID_NSEC",
-            Self::KeysSaveFailed { .. } => "KEYS_SAVE_FAILED",
-            Self::KeysAlreadyExist { .. } => "KEYS_ALREADY_EXIST",
-            Self::InvalidCoordinate { .. } => "INVALID_COORDINATE",
-            Self::Io { .. } => "IO_ERROR",
-            Self::InvalidJson { .. } => "INVALID_JSON",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn retryable(&self) -> bool {
         matches!(self, Self::RelayUnreachable { .. })
     }
 
     pub fn fix(&self) -> String {
         match self {

---- error::tests::code_io_error stdout ----

thread 'error::tests::code_io_error' (5441519) panicked at src/error.rs:177:9:
assertion `left == right` failed
  left: ""
 right: "IO_ERROR"

---- error::tests::code_keys_already_exist stdout ----

thread 'error::tests::code_keys_already_exist' (5441520) panicked at src/error.rs:165:9:
assertion `left == right` failed
  left: ""
 right: "KEYS_ALREADY_EXIST"

---- error::tests::code_keys_not_found stdout ----

thread 'error::tests::code_keys_not_found' (5441521) panicked at src/error.rs:114:9:
assertion `left == right` failed
  left: ""
 right: "KEYS_NOT_FOUND"

failures:
    error::tests::code_header_missing_d_tag
    error::tests::code_header_not_found
    error::tests::code_invalid_coordinate
    error::tests::code_invalid_event_id
    error::tests::code_invalid_json
    error::tests::code_invalid_nsec
    error::tests::code_io_error
    error::tests::code_keys_already_exist
    error::tests::code_keys_not_found
    error::tests::code_keys_save_failed
    error::tests::code_no_results
    error::tests::code_relay_rejected

test result: FAILED. 80 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
