*** src/error.rs:66:9: replace AppError::retryable -> bool with true

*** mutation diff:
--- src/error.rs
+++ replace AppError::retryable -> bool with true
@@ -58,17 +58,17 @@
             Self::KeysAlreadyExist { .. } => "KEYS_ALREADY_EXIST",
             Self::InvalidCoordinate { .. } => "INVALID_COORDINATE",
             Self::Io { .. } => "IO_ERROR",
             Self::InvalidJson { .. } => "INVALID_JSON",
         }
     }
 
     pub fn retryable(&self) -> bool {
-        matches!(self, Self::RelayUnreachable { .. })
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn fix(&self) -> String {
         match self {
             Self::KeysNotFound { .. } => {
                 "Run `wokhei init --generate` to create a new keypair".to_string()
             }
             Self::RelayUnreachable { url } => {

---- error::tests::command_error_from_app_error_preserves_retryable stdout ----

thread 'error::tests::command_error_from_app_error_preserves_retryable' (5451549) panicked at src/error.rs:289:9:
assertion failed: !cmd_err2.retryable

---- error::tests::non_relay_errors_are_not_retryable stdout ----

thread 'error::tests::non_relay_errors_are_not_retryable' (5451554) panicked at src/error.rs:212:9:
assertion failed: !AppError::KeysNotFound { path: "/x".into() }.retryable()

failures:
    error::tests::command_error_from_app_error_preserves_retryable
    error::tests::non_relay_errors_are_not_retryable

test result: FAILED. 98 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
