*** src/error.rs:70:9: replace AppError::fix -> String with String::new()

*** mutation diff:
--- src/error.rs
+++ replace AppError::fix -> String with String::new()
@@ -62,54 +62,17 @@
         }
     }
 
     pub fn retryable(&self) -> bool {
         matches!(self, Self::RelayUnreachable { .. })
     }
 
     pub fn fix(&self) -> String {
-        match self {
-            Self::KeysNotFound { .. } => {
-                "Run `wokhei init --generate` to create a new keypair".to_string()
-            }
-            Self::RelayUnreachable { url } => {
-                format!("Check that the relay at {url} is running. For local dev: `cd strfry && docker compose up -d`")
-            }
-            Self::RelayRejected { .. } => {
-                "Check event format and relay write policy".to_string()
-            }
-            Self::HeaderNotFound { .. } => {
-                "Verify the event ID, or use `--header-coordinate` for cross-relay references"
-                    .to_string()
-            }
-            Self::HeaderMissingDTag => {
-                "The header event is malformed (no d-tag). Create a new addressable header with `--d-tag`".to_string()
-            }
-            Self::InvalidEventId { .. } => {
-                "Use a hex event ID from a previous command's result".to_string()
-            }
-            Self::NoResults => {
-                "Try different filters, or check that the relay has data".to_string()
-            }
-            Self::InvalidNsec => "Use bech32 nsec1... format".to_string(),
-            Self::KeysSaveFailed { .. } => {
-                "Check file permissions on ~/.wokhei/".to_string()
-            }
-            Self::KeysAlreadyExist { path } => {
-                format!("Keys already exist at {path}. Back up and remove to regenerate.")
-            }
-            Self::InvalidCoordinate { .. } => {
-                "Format: kind:pubkey:d-tag (e.g., 39998:abc123:my-list)".to_string()
-            }
-            Self::Io { .. } => "Check file permissions and disk space".to_string(),
-            Self::InvalidJson { .. } => {
-                "Provide valid JSON input".to_string()
-            }
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<AppError> for CommandError {
     fn from(err: AppError) -> Self {
         CommandError::new(err.to_string(), err.code(), err.fix()).retryable(err.retryable())
     }
 }

---- error::tests::fix_keys_already_exist_contains_path stdout ----

thread 'error::tests::fix_keys_already_exist_contains_path' (5446739) panicked at src/error.rs:208:9:
assertion failed: fix.contains("/home/.wokhei/keys")

---- error::tests::fix_relay_unreachable_contains_url stdout ----

thread 'error::tests::fix_relay_unreachable_contains_url' (5446741) panicked at src/error.rs:202:9:
assertion failed: fix.contains("ws://myrelay")

---- error::tests::fix_keys_not_found_suggests_init stdout ----

thread 'error::tests::fix_keys_not_found_suggests_init' (5446740) panicked at src/error.rs:196:9:
assertion failed: fix.contains("init")

failures:
    error::tests::fix_keys_already_exist_contains_path
    error::tests::fix_keys_not_found_suggests_init
    error::tests::fix_relay_unreachable_contains_url
    error::tests::fix_strings_are_all_non_empty

test result: FAILED. 96 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
