*** src/header.rs:49:8: delete ! in build_header_tags

*** mutation diff:
--- src/header.rs
+++ delete ! in build_header_tags
@@ -41,17 +41,17 @@
     event_tags.push(Tag::custom(TagKind::custom("title"), [title.clone()]));
 
     if let Some(desc) = description {
         event_tags.push(Tag::custom(TagKind::custom("description"), [desc.clone()]));
     }
     if !required.is_empty() {
         event_tags.push(Tag::custom(TagKind::custom("required"), required.clone()));
     }
-    if !recommended.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */recommended.is_empty() {
         event_tags.push(Tag::custom(
             TagKind::custom("recommended"),
             recommended.clone(),
         ));
     }
     for tag in tags_list {
         event_tags.push(Tag::hashtag(tag));
     }

---- header::tests::recommended_fields_present stdout ----

thread 'header::tests::recommended_fields_present' (5437612) panicked at src/header.rs:172:50:
recommended tag missing

failures:
    header::tests::recommended_fields_present

test result: FAILED. 99 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
