*** src/item.rs:120:5: replace build_item_tags -> Vec<Tag> with vec![]

*** mutation diff:
--- src/item.rs
+++ replace build_item_tags -> Vec<Tag> with vec![]
@@ -112,32 +112,17 @@
 
 fn build_item_tags(
     header_ref_tag: Tag,
     resource: &str,
     z_tag: &str,
     fields: &[String],
     d_tag: Option<&str>,
 ) -> Vec<Tag> {
-    let mut event_tags: Vec<Tag> = vec![header_ref_tag];
-    event_tags.push(Tag::custom(TagKind::custom("r"), [resource]));
-    event_tags.push(Tag::custom(TagKind::custom("z"), [z_tag]));
-    event_tags.push(Tag::custom(TagKind::custom("client"), ["wokhei"]));
-
-    for field in fields {
-        if let Some((key, val)) = field.split_once('=') {
-            event_tags.push(Tag::custom(TagKind::custom(key), [val]));
-        }
-    }
-
-    if let Some(d) = d_tag {
-        event_tags.push(Tag::identifier(d));
-    }
-
-    event_tags
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_item_params(params: &ItemParams) -> Result<(), CommandError> {
     if params.header.is_none() && params.header_coordinate.is_none() {
         return Err(CommandError::new(
             "Specify --header=<event-id> or --header-coordinate=<kind:pubkey:d-tag>",
             "MISSING_ARG",
             "Use --header with an event ID, or --header-coordinate with kind:pubkey:d-tag",

---- item::tests::build_item_tags_fields_without_equals_skipped stdout ----

thread 'item::tests::build_item_tags_fields_without_equals_skipped' (5438482) panicked at src/item.rs:325:9:
assertion `left == right` failed
  left: 0
 right: 4

---- item::tests::build_item_tags_d_tag_present stdout ----

thread 'item::tests::build_item_tags_d_tag_present' (5438480) panicked at src/item.rs:331:38:
d tag missing

---- item::tests::build_item_tags_fields_with_equals_become_tags stdout ----

thread 'item::tests::build_item_tags_fields_with_equals_become_tags' (5438481) panicked at src/item.rs:314:46:
color tag missing

failures:
    item::tests::build_item_tags_d_tag_present
    item::tests::build_item_tags_fields_with_equals_become_tags
    item::tests::build_item_tags_fields_without_equals_skipped
    item::tests::build_item_tags_has_client
    item::tests::build_item_tags_has_header_ref
    item::tests::build_item_tags_has_resource
    item::tests::build_item_tags_has_z_tag

test result: FAILED. 93 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
