*** src/item.rs:12:20: replace != with == in parse_coordinate_str

*** mutation diff:
--- src/item.rs
+++ replace != with == in parse_coordinate_str
@@ -4,17 +4,17 @@
 
 use agcli::{CommandError, CommandOutput, NextAction};
 
 use crate::error::AppError;
 use crate::keys::load_keys;
 
 fn parse_coordinate_str(input: &str) -> Result<(u16, PublicKey, String), AppError> {
     let parts: Vec<&str> = input.splitn(3, ':').collect();
-    if parts.len() != 3 {
+    if parts.len() == /* ~ changed by cargo-mutants ~ */ 3 {
         return Err(AppError::InvalidCoordinate {
             input: input.to_string(),
         });
     }
     let kind_num: u16 = parts[0].parse().map_err(|_| AppError::InvalidCoordinate {
         input: input.to_string(),
     })?;
     let pubkey = PublicKey::parse(parts[1]).map_err(|_| AppError::InvalidCoordinate {

---- item::tests::parse_coordinate_empty_d_tag stdout ----

thread 'item::tests::parse_coordinate_empty_d_tag' (5442003) panicked at src/item.rs:216:58:
called `Result::unwrap()` on an `Err` value: InvalidCoordinate { input: "39998:ac955b4ef32d0bd35d9921a403021d6758ba64904bc9cc19200b3d02dedfe24a:" }

---- item::tests::parse_coordinate_d_tag_with_colons_preserved stdout ----

thread 'item::tests::parse_coordinate_d_tag_with_colons_preserved' (5442002) panicked at src/item.rs:208:58:
called `Result::unwrap()` on an `Err` value: InvalidCoordinate { input: "39998:77bcdb62dcf48291cb4c18d503c7dc780197782301905c745e61dce17a4cfe09:d:tag:with:colons" }

---- item::tests::parse_coordinate_valid stdout ----

thread 'item::tests::parse_coordinate_valid' (5442008) panicked at src/item.rs:172:66:
called `Result::unwrap()` on an `Err` value: InvalidCoordinate { input: "39998:051d5e246b6ed47c8aab6bc7bde24816552184d9a9fdeee275beb4af733e02d1:my-list" }

failures:
    item::tests::parse_coordinate_d_tag_with_colons_preserved
    item::tests::parse_coordinate_empty_d_tag
    item::tests::parse_coordinate_valid

test result: FAILED. 97 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
