*** src/item.rs:139:5: replace validate_item_params -> Result<(), CommandError> with Ok(())

*** mutation diff:
--- src/item.rs
+++ replace validate_item_params -> Result<(), CommandError> with Ok(())
@@ -131,31 +131,17 @@
     if let Some(d) = d_tag {
         event_tags.push(Tag::identifier(d));
     }
 
     event_tags
 }
 
 fn validate_item_params(params: &ItemParams) -> Result<(), CommandError> {
-    if params.header.is_none() && params.header_coordinate.is_none() {
-        return Err(CommandError::new(
-            "Specify --header=<event-id> or --header-coordinate=<kind:pubkey:d-tag>",
-            "MISSING_ARG",
-            "Use --header with an event ID, or --header-coordinate with kind:pubkey:d-tag",
-        ));
-    }
-    if params.addressable && params.d_tag.is_none() {
-        return Err(CommandError::new(
-            "--addressable requires --d-tag=<identifier>",
-            "MISSING_ARG",
-            "Add --d-tag=<identifier> when using --addressable",
-        ));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     // -----------------------------------------------------------------------
     // parse_coordinate_str

---- item::tests::validate_neither_header_nor_coordinate_errors stdout ----

thread 'item::tests::validate_neither_header_nor_coordinate_errors' (5439359) panicked at src/item.rs:239:44:
called `Result::unwrap_err()` on an `Ok` value: ()

---- item::tests::validate_addressable_without_d_tag_errors stdout ----

thread 'item::tests::validate_addressable_without_d_tag_errors' (5439356) panicked at src/item.rs:247:44:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    item::tests::validate_addressable_without_d_tag_errors
    item::tests::validate_neither_header_nor_coordinate_errors

test result: FAILED. 98 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
