*** src/item.rs:146:27: replace && with || in validate_item_params

*** mutation diff:
--- src/item.rs
+++ replace && with || in validate_item_params
@@ -138,17 +138,17 @@
 fn validate_item_params(params: &ItemParams) -> Result<(), CommandError> {
     if params.header.is_none() && params.header_coordinate.is_none() {
         return Err(CommandError::new(
             "Specify --header=<event-id> or --header-coordinate=<kind:pubkey:d-tag>",
             "MISSING_ARG",
             "Use --header with an event ID, or --header-coordinate with kind:pubkey:d-tag",
         ));
     }
-    if params.addressable && params.d_tag.is_none() {
+    if params.addressable || /* ~ changed by cargo-mutants ~ */ params.d_tag.is_none() {
         return Err(CommandError::new(
             "--addressable requires --d-tag=<identifier>",
             "MISSING_ARG",
             "Add --d-tag=<identifier> when using --addressable",
         ));
     }
     Ok(())
 }

---- item::tests::validate_coordinate_only_ok stdout ----

thread 'item::tests::validate_coordinate_only_ok' (5449788) panicked at src/item.rs:247:9:
assertion failed: validate_item_params(&p).is_ok()

---- item::tests::validate_header_only_ok stdout ----

thread 'item::tests::validate_header_only_ok' (5449789) panicked at src/item.rs:241:9:
assertion failed: validate_item_params(&p).is_ok()

---- item::tests::validate_addressable_with_d_tag_ok stdout ----

thread 'item::tests::validate_addressable_with_d_tag_ok' (5449786) panicked at src/item.rs:270:9:
assertion failed: validate_item_params(&p).is_ok()

failures:
    item::tests::validate_addressable_with_d_tag_ok
    item::tests::validate_coordinate_only_ok
    item::tests::validate_header_only_ok
    item::tests::validate_non_addressable_without_d_tag_ok

test result: FAILED. 96 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
