*** src/keys.rs:116:25: replace == with != in read_nsec

*** mutation diff:
--- src/keys.rs
+++ replace == with != in read_nsec
@@ -108,17 +108,17 @@
         NextAction::new(
             format!("wokhei list-headers --author={pubkey_hex}"),
             "List your headers",
         ),
     ]
 }
 
 fn read_nsec<R: io::Read>(source: &str, stdin: R) -> Result<String, CommandError> {
-    let raw = if source == "-" {
+    let raw = if source != /* ~ changed by cargo-mutants ~ */ "-" {
         let mut buf = String::new();
         let mut reader = stdin;
         reader.read_to_string(&mut buf).map_err(|e| {
             CommandError::from(AppError::Io {
                 reason: e.to_string(),
             })
         })?;
         buf

---- keys::tests::read_nsec_from_stdin_cursor stdout ----

thread 'keys::tests::read_nsec_from_stdin_cursor' (5435931) panicked at src/keys.rs:284:45:
called `Result::unwrap()` on an `Err` value: CommandError { message: "IO error: Failed to read -: No such file or directory (os error 2)", code: "IO_ERROR", fix: "Check file permissions and disk space", retryable: false, next_actions: [] }

---- keys::tests::read_nsec_nonexistent_file_errors stdout ----

thread 'keys::tests::read_nsec_nonexistent_file_errors' (5435932) panicked at src/keys.rs:308:67:
called `Result::unwrap_err()` on an `Ok` value: ""

---- keys::tests::read_nsec_trims_whitespace stdout ----

thread 'keys::tests::read_nsec_trims_whitespace' (5435933) panicked at src/keys.rs:291:45:
called `Result::unwrap()` on an `Err` value: CommandError { message: "IO error: Failed to read -: No such file or directory (os error 2)", code: "IO_ERROR", fix: "Check file permissions and disk space", retryable: false, next_actions: [] }

failures:
    keys::tests::read_nsec_from_file
    keys::tests::read_nsec_from_stdin_cursor
    keys::tests::read_nsec_nonexistent_file_errors
    keys::tests::read_nsec_trims_whitespace

test result: FAILED. 96 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
