*** src/keys.rs:140:8: delete ! in init

*** mutation diff:
--- src/keys.rs
+++ delete ! in init
@@ -132,17 +132,17 @@
     Ok(raw.trim().to_string())
 }
 
 fn read_nsec_from_source(source: &str) -> Result<String, CommandError> {
     read_nsec(source, io::stdin())
 }
 
 pub fn init(generate: bool, import: Option<&str>) -> Result<CommandOutput, CommandError> {
-    if !generate && import.is_none() {
+    if  /* ~ changed by cargo-mutants ~ */generate && import.is_none() {
         return Err(CommandError::new(
             "Specify --generate or --import <source>",
             "MISSING_ARG",
             "Use --generate to create a new keypair, or --import - (stdin) / --import <file>",
         )
         .next_actions(vec![
             NextAction::new("wokhei init --generate", "Generate a new keypair"),
             NextAction::new("wokhei init --import -", "Import nsec from stdin"),

---- keys::tests::init_generate_does_not_return_missing_arg stdout ----

thread 'keys::tests::init_generate_does_not_return_missing_arg' (5446344) panicked at src/keys.rs:368:23:
assertion `left != right` failed
  left: "MISSING_ARG"
 right: "MISSING_ARG"

---- keys::tests::init_neither_flag_errors stdout ----

thread 'keys::tests::init_neither_flag_errors' (5446345) panicked at src/keys.rs:359:9:
assertion `left == right` failed
  left: "KEYS_ALREADY_EXIST"
 right: "MISSING_ARG"

failures:
    keys::tests::init_generate_does_not_return_missing_arg
    keys::tests::init_neither_flag_errors

test result: FAILED. 98 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
