*** src/keys.rs:37:8: delete ! in load_keys_from

*** mutation diff:
--- src/keys.rs
+++ delete ! in load_keys_from
@@ -29,17 +29,17 @@
 }
 
 pub fn keys_exist() -> bool {
     keys_path().exists()
 }
 
 fn load_keys_from(base: &Path) -> Result<Keys, AppError> {
     let path = keys_path_from(base);
-    if !path.exists() {
+    if  /* ~ changed by cargo-mutants ~ */path.exists() {
         return Err(AppError::KeysNotFound {
             path: path.display().to_string(),
         });
     }
     let nsec = fs::read_to_string(&path).map_err(|e| AppError::Io {
         reason: e.to_string(),
     })?;
     Keys::parse(nsec.trim()).map_err(|_| AppError::InvalidNsec)

---- keys::tests::load_from_nonexistent_path_errors stdout ----

thread 'keys::tests::load_from_nonexistent_path_errors' (5438069) panicked at src/keys.rs:329:9:
assertion `left == right` failed
  left: "IO_ERROR"
 right: "KEYS_NOT_FOUND"

---- keys::tests::save_and_load_roundtrip stdout ----

thread 'keys::tests::save_and_load_roundtrip' (5438077) panicked at src/keys.rs:321:49:
called `Result::unwrap()` on an `Err` value: KeysNotFound { path: "/var/folders/vs/2jym3s9d2y5gdg3xphkh_d8h0000gn/T/.tmpAxBXD6/.wokhei/keys" }

failures:
    keys::tests::load_from_nonexistent_path_errors
    keys::tests::save_and_load_roundtrip

test result: FAILED. 98 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
