*** src/keys.rs:53:5: replace save_keys_at -> Result<(), AppError> with Ok(())

*** mutation diff:
--- src/keys.rs
+++ replace save_keys_at -> Result<(), AppError> with Ok(())
@@ -45,45 +45,17 @@
     Keys::parse(nsec.trim()).map_err(|_| AppError::InvalidNsec)
 }
 
 pub fn load_keys() -> Result<Keys, AppError> {
     load_keys_from(&home_base())
 }
 
 fn save_keys_at(base: &Path, keys: &Keys) -> Result<(), AppError> {
-    let dir = keys_dir_from(base);
-    fs::create_dir_all(&dir).map_err(|e| AppError::KeysSaveFailed {
-        reason: e.to_string(),
-    })?;
-
-    let path = keys_path_from(base);
-    let nsec = keys
-        .secret_key()
-        .to_bech32()
-        .map_err(|e| AppError::KeysSaveFailed {
-            reason: e.to_string(),
-        })?;
-
-    fs::write(&path, &nsec).map_err(|e| AppError::KeysSaveFailed {
-        reason: e.to_string(),
-    })?;
-
-    // chmod 0600
-    #[cfg(unix)]
-    {
-        use std::os::unix::fs::PermissionsExt;
-        fs::set_permissions(&path, fs::Permissions::from_mode(0o600)).map_err(|e| {
-            AppError::KeysSaveFailed {
-                reason: e.to_string(),
-            }
-        })?;
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn save_keys(keys: &Keys) -> Result<(), AppError> {
     save_keys_at(&home_base(), keys)
 }
 
 fn keys_result(keys: &Keys) -> serde_json::Value {
     let pubkey_hex = keys.public_key().to_hex();

---- keys::tests::save_creates_directory_and_file stdout ----

thread 'keys::tests::save_creates_directory_and_file' (5453477) panicked at src/keys.rs:309:9:
assertion failed: keys_path_from(dir.path()).exists()

---- keys::tests::save_and_load_roundtrip stdout ----

thread 'keys::tests::save_and_load_roundtrip' (5453476) panicked at src/keys.rs:293:49:
called `Result::unwrap()` on an `Err` value: KeysNotFound { path: "/var/folders/vs/2jym3s9d2y5gdg3xphkh_d8h0000gn/T/.tmpkAdPts/.wokhei/keys" }

---- keys::tests::save_sets_permissions_0600 stdout ----

thread 'keys::tests::save_sets_permissions_0600' (5453478) panicked at src/keys.rs:320:65:
called `Result::unwrap()` on an `Err` value: Os { code: 2, kind: NotFound, message: "No such file or directory" }

failures:
    keys::tests::save_and_load_roundtrip
    keys::tests::save_creates_directory_and_file
    keys::tests::save_sets_permissions_0600
    tests::resolve_relay_env_var

test result: FAILED. 96 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
