*** src/keys.rs:89:5: replace keys_result -> serde_json::Value with Default::default()

*** mutation diff:
--- src/keys.rs
+++ replace keys_result -> serde_json::Value with Default::default()
@@ -81,26 +81,17 @@
     Ok(())
 }
 
 fn save_keys(keys: &Keys) -> Result<(), AppError> {
     save_keys_at(&home_base(), keys)
 }
 
 fn keys_result(keys: &Keys) -> serde_json::Value {
-    let pubkey_hex = keys.public_key().to_hex();
-    let npub = keys
-        .public_key()
-        .to_bech32()
-        .unwrap_or_else(|_| pubkey_hex.clone());
-    json!({
-        "pubkey": pubkey_hex,
-        "npub": npub,
-        "keys_path": keys_path().display().to_string()
-    })
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn post_init_actions(pubkey_hex: &str) -> Vec<NextAction> {
     vec![
         NextAction::new("wokhei whoami", "Verify your identity"),
         NextAction::new(
             "wokhei create-header --name=<name> --title=<title>",
             "Create your first list header",

---- keys::tests::keys_result_contains_pubkey stdout ----

thread 'keys::tests::keys_result_contains_pubkey' (5450671) panicked at src/keys.rs:229:41:
called `Option::unwrap()` on a `None` value

---- keys::tests::keys_result_has_keys_path stdout ----

thread 'keys::tests::keys_result_has_keys_path' (5450672) panicked at src/keys.rs:243:41:
called `Option::unwrap()` on a `None` value

---- keys::tests::keys_result_npub_starts_with_npub1 stdout ----

thread 'keys::tests::keys_result_npub_starts_with_npub1' (5450673) panicked at src/keys.rs:236:36:
called `Option::unwrap()` on a `None` value

failures:
    keys::tests::keys_result_contains_pubkey
    keys::tests::keys_result_has_keys_path
    keys::tests::keys_result_npub_starts_with_npub1

test result: FAILED. 97 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
