*** src/main.rs:34:5: replace parse_csv -> Vec<String> with vec![String::new()]

*** mutation diff:
--- src/main.rs
+++ replace parse_csv -> Vec<String> with vec![String::new()]
@@ -26,20 +26,17 @@
             "INVALID_ARGS",
             format!("Use --{name} without a value, or remove it"),
         )),
     }
 }
 
 /// Parse comma-separated flag value into Vec<String>. Absent = empty vec.
 fn parse_csv(flag_value: Option<&str>) -> Vec<String> {
-    match flag_value {
-        Some(s) if !s.is_empty() => s.split(',').map(|v| v.trim().to_string()).collect(),
-        _ => Vec::new(),
-    }
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse a usize flag with a default. Invalid values return error.
 fn parse_usize_flag(
     req: &CommandRequest<'_>,
     name: &str,
     default: usize,
 ) -> Result<usize, CommandError> {

---- tests::parse_csv_empty_string_returns_empty stdout ----

thread 'tests::parse_csv_empty_string_returns_empty' (5439850) panicked at src/main.rs:274:9:
assertion failed: parse_csv(Some("")).is_empty()

---- tests::parse_csv_trims_whitespace stdout ----

thread 'tests::parse_csv_trims_whitespace' (5439854) panicked at src/main.rs:289:9:
assertion `left == right` failed
  left: [""]
 right: ["a", "b"]

---- tests::parse_csv_none_returns_empty stdout ----

thread 'tests::parse_csv_none_returns_empty' (5439852) panicked at src/main.rs:269:9:
assertion failed: parse_csv(None).is_empty()

failures:
    tests::parse_csv_empty_string_returns_empty
    tests::parse_csv_multiple_values
    tests::parse_csv_none_returns_empty
    tests::parse_csv_single_value
    tests::parse_csv_trims_whitespace

test result: FAILED. 95 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
