*** src/main.rs:35:20: replace match guard !s.is_empty() with true in parse_csv

*** mutation diff:
--- src/main.rs
+++ replace match guard !s.is_empty() with true in parse_csv
@@ -27,17 +27,17 @@
             format!("Use --{name} without a value, or remove it"),
         )),
     }
 }
 
 /// Parse comma-separated flag value into Vec<String>. Absent = empty vec.
 fn parse_csv(flag_value: Option<&str>) -> Vec<String> {
     match flag_value {
-        Some(s) if !s.is_empty() => s.split(',').map(|v| v.trim().to_string()).collect(),
+        Some(s) if true /* ~ changed by cargo-mutants ~ */ => s.split(',').map(|v| v.trim().to_string()).collect(),
         _ => Vec::new(),
     }
 }
 
 /// Parse a usize flag with a default. Invalid values return error.
 fn parse_usize_flag(
     req: &CommandRequest<'_>,
     name: &str,

---- tests::parse_csv_empty_string_returns_empty stdout ----

thread 'tests::parse_csv_empty_string_returns_empty' (5448546) panicked at src/main.rs:277:9:
assertion failed: parse_csv(Some("")).is_empty()

failures:
    tests::parse_csv_empty_string_returns_empty

test result: FAILED. 99 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
