*** src/main.rs:46:5: replace parse_usize_flag -> Result<usize, CommandError> with Ok(0)

*** mutation diff:
--- src/main.rs
+++ replace parse_usize_flag -> Result<usize, CommandError> with Ok(0)
@@ -38,26 +38,17 @@
 }
 
 /// Parse a usize flag with a default. Invalid values return error.
 fn parse_usize_flag(
     req: &CommandRequest<'_>,
     name: &str,
     default: usize,
 ) -> Result<usize, CommandError> {
-    match req.flag(name) {
-        None => Ok(default),
-        Some(v) => v.parse().map_err(|_| {
-            CommandError::new(
-                format!("--{name} must be a positive integer, got: {v}"),
-                "INVALID_ARGS",
-                format!("Provide a valid number for --{name}"),
-            )
-        }),
-    }
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve relay URL from --relay flag, `WOKHEI_RELAY` env var, or default.
 fn resolve_relay(req: &CommandRequest<'_>) -> String {
     req.flag("relay")
         .map(String::from)
         .or_else(|| std::env::var("WOKHEI_RELAY").ok())
         .unwrap_or_else(|| "ws://localhost:7777".to_string())

---- tests::usize_flag_invalid_errors stdout ----

thread 'tests::usize_flag_invalid_errors' (5440743) panicked at src/main.rs:371:9:
assertion failed: !exec.envelope().ok()

---- tests::usize_flag_absent_returns_default stdout ----

thread 'tests::usize_flag_absent_returns_default' (5440742) panicked at src/main.rs:349:9:
assertion `left == right` failed
  left: Number(0)
 right: 42

---- tests::usize_flag_valid_number stdout ----

thread 'tests::usize_flag_valid_number' (5440744) panicked at src/main.rs:357:9:
assertion `left == right` failed
  left: Number(0)
 right: 10

failures:
    tests::usize_flag_absent_returns_default
    tests::usize_flag_invalid_errors
    tests::usize_flag_valid_number

test result: FAILED. 97 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
