*** src/query.rs:29:24: replace >= with < in event_to_json

*** mutation diff:
--- src/query.rs
+++ replace >= with < in event_to_json
@@ -21,17 +21,17 @@
         "tags": tags,
         "content": event.content,
         "sig": event.sig.to_string(),
     });
 
     // Extract common DCoSL fields from tags for convenience
     for tag in event.tags.iter() {
         let parts = tag.as_slice();
-        if parts.len() >= 2 {
+        if parts.len() < /* ~ changed by cargo-mutants ~ */ 2 {
             let key = parts[0].as_str();
             match key {
                 "names" => {
                     let names: Vec<&str> = parts[1..].iter().map(String::as_str).collect();
                     obj["name"] = json!(names.first().unwrap_or(&""));
                     if names.len() > 1 {
                         obj["aliases"] = json!(&names[1..]);
                     }

---- query::tests::event_to_json_single_name_no_aliases stdout ----

thread 'query::tests::event_to_json_single_name_no_aliases' (5452064) panicked at src/query.rs:102:9:
assertion `left == right` failed
  left: Null
 right: "mylist"

---- query::tests::event_to_json_d_tag_creates_coordinate stdout ----

thread 'query::tests::event_to_json_d_tag_creates_coordinate' (5452061) panicked at src/query.rs:135:46:
called `Option::unwrap()` on a `None` value

---- query::tests::event_to_json_description_extracted stdout ----

thread 'query::tests::event_to_json_description_extracted' (5452062) panicked at src/query.rs:123:9:
assertion `left == right` failed
  left: Null
 right: "A description"

failures:
    query::tests::event_to_json_d_tag_creates_coordinate
    query::tests::event_to_json_description_extracted
    query::tests::event_to_json_names_tag_extracts_name_and_aliases
    query::tests::event_to_json_single_name_no_aliases
    query::tests::event_to_json_title_extracted

test result: FAILED. 95 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
