*** src/query.rs:45:17: delete match arm "d" in event_to_json

*** mutation diff:
--- src/query.rs
+++ delete match arm "d" in event_to_json
@@ -37,22 +37,17 @@
                     }
                 }
                 "title" => {
                     obj["title"] = json!(parts[1].as_str());
                 }
                 "description" => {
                     obj["description"] = json!(parts[1].as_str());
                 }
-                "d" => {
-                    let pubkey_hex = event.pubkey.to_hex();
-                    let d_val = parts[1].as_str();
-                    obj["coordinate"] =
-                        json!(format!("{}:{}:{}", event.kind.as_u16(), pubkey_hex, d_val));
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
         }
     }
 
     obj
 }

---- query::tests::event_to_json_d_tag_creates_coordinate stdout ----

thread 'query::tests::event_to_json_d_tag_creates_coordinate' (5444611) panicked at src/query.rs:130:46:
called `Option::unwrap()` on a `None` value

failures:
    query::tests::event_to_json_d_tag_creates_coordinate

test result: FAILED. 99 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
